Revit 2024 API
ParameterTypeId.StructuralFrameCutLength Property
 "Cut Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralFrameCutLength { get; }
Visual Basic
Public Shared ReadOnly Property StructuralFrameCutLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralFrameCutLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace